app/views/conversions/_conversion_result.html.erb

INSERT INTO "conversions" ("amount", "converted_amount", "base_currency", "target_currency", "exchange_rate_id", "created_at", "updated_at") VALUES (1000.0, 876.89, 'USD', 'EUR', 1, '2025-08-04 04:42:58.963368', '2025-08-04 04:42:58.963368') RETURNING "id"
---
    <p>Rate last updated: <%= time_ago_in_words(conversion.exchange_rate.fetched_at) %> ago</p>
    <p>Conversion performed: <%= conversion.created_at.strftime("%B %d, %Y at %I:%M %p") %></p>