app/controllers/conversions_controller.rb

SELECT "conversions".* FROM "conversions" ORDER BY "conversions"."created_at" DESC LIMIT 10
SELECT "exchange_rates".* FROM "exchange_rates" WHERE "exchange_rates"."id" IN (2, 1)
---
    def index
      @conversion = Conversion.new
      @conversions = Conversion.includes(:exchange_rate).recent.limit(10)

SELECT "conversions".* FROM "conversions" ORDER BY "conversions"."created_at" DESC LIMIT 10
SELECT "exchange_rates".* FROM "exchange_rates" WHERE "exchange_rates"."id" IN (2, 1)
---
    def create
      @conversion = Conversion.perform(
        conversion_params[:amount].to_f,
        conversion_params[:base_currency],
        conversion_params[:target_currency]
      )

      respond_to do |format|
        format.turbo_stream do
          @conversions = Conversion.includes(:exchange_rate).recent.limit(10)