app/models/exchange_rate.rb

    def self.find_or_fetch(base, target)
      rate = fresh.find_by(base_currency: base, target_currency: target)
---
SELECT "exchange_rates".* FROM "exchange_rates" WHERE (fetched_at > '2025-08-04 03:42:58.148050') AND "exchange_rates"."base_currency" = 'USD' AND "exchange_rates"."target_currency" = 'EUR' LIMIT 1